[
    "We're all goofy.",
    "If you're not feeling stupid, you're not learning.",
    "Perfection is reached not when there is nothing more to add, but when there is nothing more to subtract.",
    "You can easily stay focused on your task, not by power of will, but by understanding that you don't need to do any of those distracting things, and that they won't make you happy.",
    "You sometimes get distracted by things that are more interesting. If that happens, just put on a youtube-video to listen to in the background. It will draw your subconscious away from what distracted you.",
    "Resistance against a task takes up tons of energy. Instead of resisting, focus on the aspects of a task that you like.",
    "A small skill perfected is better than a large skill half-baked.",
    "Bad: 'Im glad its over!'. Good: 'Oh, so sad its over!'",
    "Having a technical job doesn't mean that you don't need any social skills.",
    "Explore and discover.",
    "Nach oben hin ist Platz.",
    "Sure I can do this for you! While you're there, could you do ... ",
    "Eleminieren, automatisieren, delegieren.",
    "For people to like you, you should be a person that you like yourself.",
    "Programmers that get unmotivated usually suffer from simple things: not enough water, not enough sleep, not enough exercise.",
    "You know you're not the smartest man in the universe. The art is to do things with the potential that you have, however little it may be. That is not so much about brains as it is about heart.",
    "Ich bin nicht so sehr ein Informatiker als vielmehr ein Spielzeugmacher.",
    "If as a programmer you need more time, ask your client for details, example-data, use-cases, tests etc.",
    "At work, you shouldn't ask yourself: what do I need to do? You should ask yourself: What can I do to add to my achievement list?",
    "You will always be dealing with legacy code. Here is how to work with it without going mental: 1. add really good, on demand logging. 2. add a repl like testenvironment 3. add unit tests when you change things.",
    "Fight is better than flight.",
    "Selbstbewusstsein und Empathie.",
    "Trag dein Zuhause in dir.",
    "A person is very much defined by his surroundings. You may have a rich inner life, but if you dont expose it, others wont know about it, you miss the feedback of your ideas interacting with others, you will be forgotten when you leave.",
    "Learn to laugh at yourself in public. Teamwork is the most important part of programming. Personal failure is the most intense part of teamwork.",
    "In shared projects, avoid architecture decisions - in fact, avoid architecture as much as possible. The flatter, the better.",
    "Any time you want to procrastinate, it's because something's not right. Find out why.",
    "Good things don't just come to you. You must go out and get them.",
    "State must be serializable and separate from logic. You can ensure this is to keep state in a database from the beginning. (Riesgos: step-state and step-data in database, but step-function in code)",
    "Reasoning can be automated. Experience cannot.",
    "Building is hard. You must make the process enjoyable, because it will take longer than you think. Not only the app must be beautiful, but so must your office.",
    "If you don't handle one problem at a time, then later your old problems will get in the way with current - and more urgent - problems.",
    "wissenschaftler haben herausgefunden... – und sind wieder hineingegangen.",
"heute war schrottwichteln im kindergarten – wir sind die neuen eltern von kevin.",
"wie nennt man jemanden, der so tut, als würde er etwas werfen? – scheinwerfer.",
"was ist grün, schlau und stellt viele fragen? – günther lauch.",
"ich hab einem hippster ins bein geschossen – jetzt hoppst´er.",
"wie nennt man einen bumerang, der nicht zurückkommt? – stock.",
"wie heißt die frau von herkules? – frau kules.",
"sagt die eine kuh 'muuuh', sagt die andere 'hey, das wollte ich auch gerade sagen.'",
"seit ich clean bin, sprechen meine freunde nicht mehr mit mir. der toaster und die lampe auch nicht.",
"warum fliegen vögel im winter in richtung süden? – weil es schneller geht als laufen.",
"'anton, findest du, dass ich eine schlechte mutter bin?' 'ich heiße paul.'",
"lehrerin zu peter: tut mir leid, aber ich kann dir in französisch maximal eine 5- geben“. peter darauf: 'gracias!'",
"wie nennt man einen hund, der zaubern kann? – labrakadabrador.",
"'man, ich versteh echt nicht, warum meine pflanzen immer vertrocknen!?' – jochen, steht auf dem schlauch.",
"ich wollte eigentlich einen witz über die deutsche bahn machen, aber ich glaube der kommt nicht an.",
"wie nennt man ein helles mammut? – hellmut.",
"was sagt ein bauer, der seinen trecker sucht? – wo ist mein trecker?",
"egal wie leer du im kopf bist, manche leute sind lehrer.",
"ein beamter zum anderen: 'was haben denn die leute? wir machen doch gar nichts.'",
"wie nennt man ein einhorn mit 2 hörnern? – stier.",
"warum summen bienen? – weil sie den text nicht kennen.",
"ich hab gestern meinen besen verkauft. – i don’t kehr.",
"wohin geht ein reh ohne haare? – in die reha-klinik.",
"warum sieht man ameisen nicht in kirchen? – weil sie in-sekten sind.",
"wie heißt der bruder von elvis? – zwölvis.",
"wie heißt ein hund ohne beine? – ist egal, der kommt eh nicht, wenn man ihn ruft.",
"wenn man buchstabensuppe auskotzt, ist das dann gebrochenes deutsch?",
"wie heißt ein spanier ohne auto? – carlos.",
"was sagt das schwein zum anderen? – es ist wurst, was aus uns wird.",
"ich wollte gerade spiderman anrufen, aber er hatte kein netz.",
"bei welchem arzt ist pinocchio in behandlung? – beim holz-nasen-ohren-arzt.",
"welche sprache wird in der sauna gesprochen? – schwitzerdeutsch.",
"was sind die letzten worte einer giftschlange? – mist, jetzt habe ich mir auf die zunge gebissen.",
"wie nennt man ein rudel aggressiver wölfe? – wolfgang.",
"welches gebäck weiß auf alles eine antwort? – der googlehupf.",
"was steht auf dem grab eines mathematikers? – damit hat er nicht gerechnet.",
"was kauft ein frosch im supermarkt? – quaaark.",
"was ist lila und sitzt in der kirche in der ersten reihe? – eine frommbeere.",
"treffen sich zwei jäger – beide tot.",
"treffen sich zwei rechtsanwälte, fragt der eine: 'und wie?' sagt der andere: 'nichts zu klagen.'",
"wie machen igel liebe? – megavorsichtig.",
"treffen sich zwei hellseher, fragt der eine: 'kommst du mit?' sagt der andere: 'ne, da war ich gestern schon.'",
"kommt ein skelett zum arzt, sagt der arzt: 'bisschen spät, was?'",
"was beginnt mit 't' und endet mit 'itten'? – tiefkühlfritten.",
"was bekommt der kannibale, der zu spät zum essen kommt? – die kalte schulter.",
"was trinkt ein mann vor dem sex? – einen kaffee latte.",
"was ist klein, grün und dreieckig? – das kleine grüne dreieck.",
"fragt der walfisch den thunfisch: 'was soll ich tun, fisch?' sagt der thunfisch zum walfisch: 'du hast die wahl fisch!'",
"was sagt die null zur acht? – schicker gürtel.",
"was macht die knackwurst so knackig? – das n.",
"was sitzt auf dem ast und weint? – eine heule.",
"warum findet der henker nie den rückweg? – weil er nur die hinrichtung kennt.",
"wie heißt der bruder vom werwolf? – warumwolf.",
"'oma, hast du meine tabletten gesehen? da steht lsd drauf.' 'vergiss mal die tabletten, hast du den drachen in der küche gesehen?'",
"was ist die hälfte von sechs? – halb sechs.",
"'wie lange habe ich noch zu leben, doktor?' '10!' '10? 10 was? monate? jahre?' '9, 8, 7'",
"ich hab meinem freund gerade einen limonadenwitz erzählt. fanta lustig.",
"was ist der unterschied zwischen lidl und schule? – lidl lohnt sich.",
"wer wohnt im dschungel und schummelt immer? – mogli.",
"was ist weiß und stört beim essen? – eine lawine.",
"wenn sich ein wissenschaftler ein sandwich macht, ist es dann wissenschaftlich belegt?",
"wieso können skelette schlecht lügen? – weil sie so gut zu durchschauen sind.",
"wie nennt man ein kaninchen im fitnessstudio? – pumpernickel.",
"wo sind elefanten heimisch? – in rüsselsheim.",
"warum klaut robin hood deodorants? – weil er es unter den armen verteilt.",
"wie lautet der vorname vom reh? – kartoffelpü.",
"was sagt der große stift zum kleinen stift? – wachs mal stift.",
"ich habe den joghurt fallen gelassen. er war nicht mehr haltbar.",
"'und was ist so dein lieblingsfilm?' 'tesafilm ist ein echt guter streifen.'",
"wisst ihr was der hammer ist? – ein werkzeug.",
"warum hat die polizei den dieb nicht verhaftet? – er hatte eine anti-haft-beschichtung.",
"wie nennt man einen deutschen im all? – alman.",
"was atmen lockführer? – zugluft.",
"welcher vogel vögelt gerne? – der fuckuck.",
"wie heißt ein ritter ohne helm? – willhelm.",
"wie war die stimmung in der ddr? – sie hielt sich in grenzen.",
"wie heißt ein bär, der fliegen kann? – hubschraubär.",
"treffen sich zwei ziegen, fragt die eine: 'kommst du heute abend mit in den club?' sagt die andere: 'nein, hab keinen bock.'",
"welche schuhe kauft jemand, der zwei linke füße hat? – flipflips.",
"wie nennt man sex mit gegenständen? dingsbums.",
"gast zum kellner: 'die suppe war köstlich. richten sie dem koch ein kompliment aus.' kellner zum koch: 'günther, du bist wunderschön!'",
"wann gehen u-boote unter? – am tag der offenen tür.",
"magst du chemie-witze? – chlor!",
"was macht ein arbeitsloser schauspieler? – spielt keine rolle.",
"wie nennt man ein überraschungsessen? – topf secret.",
"treffen sich zwei unsichtbare, sagt der eine: 'dich habe ich ja schon lange nicht mehr gesehen!'",
"was passiert, wenn man nachts in der bäckerei anruft? – die mehlbox geht dran.",
"wie nennt man einen unentschlossenen japanischen krieger? – nunja.",
"wie heißt die auszeichnung für besonders, brave, ruhige hunde? – no-bell-preis.",
"was sitzt auf einem baum und winkt? – ein huhu.",
"was schwimmt auf dem wasser und fängt mit z an? – zwei enten.",
"der prinz ist angepisst – rapunzel ließ ihren harn herunter.",
"in australien schaut ein pinguin total verschwitzt aus dem beutel eines kängurus und sagt: 'scheiß schüleraustausch.'",
"sagt ein gast zur kellnerin: 'hätten sie noch milch zum kaffee?' sagt die kellnerin: 'ich hab fettarme.' antwortet der gast: 'das seh ich. aber mit denen können sie mir doch milch bringen.'",
"hat mich eine prostituierte am bahnhof angesprochen. sie meinte für 30 euro macht sie alles, was ich will. jetzt rate mal, wer heute abend bei mir das laminat verlegt.",
"geht eine schwangere frau in eine bäckerei und sagt: 'ich bekomme ein brot.'sagt der bäcker: 'sachen gibt’s.'",
"was sagt ein haifisch, wenn er einen surfer sieht? 'das ist aber nett. serviert auf frühstücksbrettchen.'",
"was ist ein keks unter einem baum? ein schattiges plätzchen!",
"was macht eine bombe im bordell? puff!",
"hab mich vorhin ausgesperrt. war ganz aus dem häuschen.",
"mein hund kennt alle straßen in- und auswendig. ich nenne ihn google mops.",
"ich habe mit der pflanze ausgemacht, sie nur noch einmal im monat zu gießen. sie ist darauf eingegangen.",
"was macht ein clown im büro? faxen."

]